cask_args appdir: '~/Applications', require_sha: true

# Taps
tap 'homebrew/bundle'
tap 'homebrew/services'

# Essentials
brew 'git'
brew 'tmux'
brew 'aria2'
brew 'bat'
brew 'diff-so-fancy'
brew 'duf'
brew 'entr'
brew 'eza'
brew 'fzf'
brew 'jq'
brew 'most'
brew 'procs'
brew 'ripgrep'
brew 'rsync'
brew 'sd'
brew 'thefuck'
brew 'tldr'
brew 'tokei'
brew 'tre'
brew 'watch'
brew 'zoxide'

# Monitoring / Performance
brew 'bandwhich'
brew 'ctop'
brew 'dog'
brew 'bpytop'
brew 'dua-cli'
brew 'gping'
brew 'speedtest-cli'

# Others
brew 'httpie'
brew 'tmate'
brew 'asciinema'
brew 'navi'
brew 'neofetch'

# Casks
cask 'postman'
cask 'keka'